rust/wrk.txt
Running 30s test @ http://localhost
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.38ms    5.82ms 224.52ms   98.21%
    Req/Sec     2.78k   720.14     4.38k    65.10%
  663646 requests in 30.09s, 15.19MB read
  Socket errors: connect 0, read 663646, write 0, timeout 0
Requests/sec:  22056.08
Transfer/sec:    516.95KB